[
    {
        "period": "2023 - Present",
        "position": "Project Civil Engineer",
        "companyName": "Ove Arup",
        "location": "NYC, United States",
        "description": "As a highly experienced Project Civil Engineer specialized in bridge engineering, I lead the full lifecycle of complex bridge projects from conceptual design through detailed analysis, construction oversight, and long-term maintenance. With extensive hands-on expertise spanning decades, I specialize in structural analysis and design of diverse bridge types—including steel, concrete, cable-stayed, and arch structures—utilizing advanced software like CSI Bridge, LUSAS, MIDAS, SAP2000, and AutoCAD to deliver innovative, code-compliant solutions that withstand seismic, wind, and load challenges while optimizing costs and sustainability."
    },
    {
        "period": "2015 - 2023",
        "position": "Civil Engineer",
        "companyName": "AECOM",
        "location": "Tokyo, Japan",
        "description": "As a Chartered Civil Engineer, I take full responsibility for leading the planning, design, and delivery of complex infrastructure projects such as bridges, dams and buildings. I apply advanced engineering knowledge and practical experience to develop safe, sustainable, and cost-effective solutions that comply with all relevant standards and regulations. I manage multidisciplinary teams and collaborate with clients, contractors, and stakeholders, ensuring clear communication and effective coordination throughout all project phases."
    },
    {
        "period": "2010 - 2015",
        "position": "Graduate Civil Engineer",
        "companyName": "Mott MacDonald",
        "location": "London, United Kingdom",
        "description": "I assist in developing designs, drawings, and specifications for diverse infrastructure projects such as bridges, and water dam, utilizing tools like AutoCAD to produce accurate technical documentation and ensure alignment with engineering standards and project requirements. I conduct site inspections, survey land, and collate essential project data—including soil tests and material usage—to identify potential issues early, enabling proactive adjustments that enhance safety, efficiency, and compliance during construction phases."
    }
]